# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
# общая система:                                                                                                      # 
# у объекта есть параментры dx dy, которые стабильно к его rect.x/y прибавляются, умноженные на случайное число       # 
# периодически у объекта сбрасывается скорость                                                                        # 
# при каждом столкновении dx или dy умножаются на -1 и объект меняет направление                                      # 
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #

